OpenFOAM-2.3.x/tutorials/multiphase/potentialFreeSurfaceDyMFoam/oscillatingBox/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    freeSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          181;
        startFace       7429;
    }
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       7610;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       7630;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       7650;
    }
    floatingObject
    {
        type            wall;
        inGroups        1(wall);
        nFaces          18;
        startFace       7850;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7658;
        startFace       7868;
    }
    floatingObjectBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          19;
        startFace       15526;
    }
)

// ************************************************************************* //
